In [1]:
import pandas as pd

In [5]:
import numpy as np

In [7]:
data = pd.read_csv('./abc.csv')

In [27]:
df = pd.DataFrame(data.to_dict())
df

  student  language  science  maths  history
0   kumar        90       56     34       34
1   kevin        10       34     32       67
2   sammy        90       23     12       32
3  janice        20       67     90       45
4   peter        30       56     45       65
5    prem        90       45     45       34
6  carrol        50       90     45       23

In [39]:
df.iloc[2, 3]

12

In [45]:
df.iloc[0:5, 0:3]

  student  language  science
0   kumar        90       56
1   kevin        10       34
2   sammy        90       23
3  janice        20       67
4   peter        30       56

In [49]:
df.loc[2, 'maths']

12

In [55]:
df.loc[0:4, ['student', 'maths']]

  student  maths
0   kumar     34
1   kevin     32
2   sammy     12
3  janice     90
4   peter     45

In [73]:
df.drop('english', axis=1)

  student  language  science  maths  history
0   kumar        90       56     34       34
1   kevin        10       34     32       67
2   sammy        90       23     12       32
3  janice        20       67     90       45
4   peter        30       56     45       65
5    prem        90       45     45       34
6  carrol        50       90     45       23

In [91]:
df['english'] = np.where(df.index%2 == 0, 32, 45)

In [93]:
df

  student  language  science  maths  history  english
0   kumar        90       56     34       34       32
1   kevin        10       34     32       67       45
2   sammy        90       23     12       32       32
3  janice        20       67     90       45       45
4   peter        30       56     45       65       32
5    prem        90       45     45       34       45
6  carrol        50       90     45       23       32

# Let's Do Some Analysis

1. Students who have scored more than 40 in history

In [112]:
s = data[data['history'] > 40]['student']
s

1     kevin
3    janice
4     peter
Name: student, dtype: object

2. Students who have scored more than 100 in maths and science combined

In [126]:
data['science_maths'] = data['maths'] + data['science']
s2 = data[data['science_maths'] > 100]['student']
s2

3    janice
4     peter
6    carrol
Name: student, dtype: object

3. Students who have scored above 40 in science but below 50 in history

In [151]:
s3 = data[(data['science'] > 40) & (data['history'] < 50)] # we can't use and And or -- instead we use & and | operator
s3

  student  language  science  maths  history  science_maths
0   kumar        90       56     34       34             90
3  janice        20       67     90       45            157
5    prem        90       45     45       34             90
6  carrol        50       90     45       23            135

4. Students whose name starts with k

In [167]:
data[data['student'].str.contains('K', case=False)] 
# Or 
data[data['student'].str.startswith('k')]

  student  language  science  maths  history  science_maths
0   kumar        90       56     34       34             90
1   kevin        10       34     32       67             66

5. students who have scored more than 300 in all over subject

In [185]:
data['total_score'] = data['language'] + data['science'] + data['maths'] + data['history'] + data['science_maths']
data[data['total_score']> 300]

  student  language  science  maths  history  science_maths  total_score
0   kumar        90       56     34       34             90          304
3  janice        20       67     90       45            157          379
5    prem        90       45     45       34             90          304
6  carrol        50       90     45       23            135          343